doc/resume/resume-en.org
#+OPTIONS: toc:nil H:10

#+LaTeX_HEADER: \usepackage{mycv}
#+BEGIN_EXPORT latex
\AtBeginDvi{\special{pdf:tounicode UTF8-UCS2}}
\begin{CJK*}{UTF8}{simsun}

#+END_EXPORT


#+MACRO: first  Haojun
#+MACRO: last   Bao
#+MACRO: full {{{first}}}{{{Last}}}
#+MACRO: phone  18610314439

#+TITLE: Haojun Bao's Resume

* Work Experience
*** March 2014 - /present/
    * *CM Architect*, Smartisan, Beijing
      - Build and improve the CM (Configuration Management) system
      - Build CI (Continuous Integration) system
      - Build SmartBuilder, an online on-demand android build and publish system
      - Build and improve dev process, write dev process documents
      - Deploy my [[https://github.com/baohaojun/system-config][system-config]] project to each engineer's PC as the dev environment

        Simplify the deployment process, improve everyone's efficiency

      - Help colleague engineers solving some difficult problems
      - Provide training on dev tools and programming languages

        Record a 2 hours long video on Linux system tools usage tips: [[https://www.youtube.com/watch?v%3Dqp2b3-Guej0][YouTube]]

      - Train and support colleagues in CM team

    * *Tools Architect*, Smartisan, Beijing

      - Build some phone manufacturing test tools
      - Build some dev tools
      - Debug phone over heat issue
      - Build [[https://github.com/SmartisanTech/Wrench][Wrench]], a PC tool to connect and control Android phones, sync phone screen, record and replay manual operations of the phone in Lua script, and show phone's notifications on the PC

*** September 2013 - March 2014
    *Technical Expert*, Alibaba, Beijing
    - SMART (software measurement analysis reporting tool) Android
      Client App development.

*** November 2011 - September 2013
    *Staff Engineer*, [[http://marvell.com][Marvell]], Beijing

    - Worked as architect in the Tools team for Marvell's mobile phone
      total solution. In charge of designing and implementing mobile
      phone factory production tools.

    - Also worked in the BSP team, focusing on tools related
      components, such as Uboot, Kernel API, factory partitions.


    - Drawing from my experience with open source community, gave
      advice for cooperation process with other teams and sites of
      Marvell.


*** March 2010 - October 2011

    *Staff Engineer*, RayzerLink/Letou

    - In charge of system software development for a Tablet product
      which uses Nvidia's Tegra2 CPU. Tasks include Linux Kernel
      bring-up, device drivers (Touch, LCD, Sensors), HAL.

    - Mentored junior BSP software engineers for system programming.

*** November 2008 - March 2010

    *Senior Engineer*, [[http://www.borqs.com][Borqs]]

    - Worked in the Tools team at Borqs.

    - Designed and implemented a lot of tools for development,
      factory, customer service, test.

*** September 2005 - September 2008

    *Software Engineer*, [[http://motorola.com][Motorola]],  MD/GSG

    - Developed automated testing tool for Mobile Multimedia Software

    - Developed Mobile Multimedia Software

*** October 2004 - September 2005
    *Software Engineer*, Vitria Software

    - ERP software test

* Free Software Projects

*** Emacs
  - [[http://github.com/baohaojun/bbyac][bbyac.el]] ::  A completion command for Emacs (Emacs-lisp).

  - [[https://github.com/baohaojun/org-jira][org-jira.el]] ::  An Emacs minor mode for using org-mode to track
                    Jira issues (Emacs-lisp).

  - [[https://github.com/baohaojun/ajoke][Ajoke.el]] :: A Java/Android IDE/SDK that works with Emacs.

*** Android

  - [[https://github.com/baohaojun/BTAndroidWebViewSelection][CrossDict]] :: An English dictionary Android APK, released on [[https://play.google.com/store/apps/details?id=com.baohaojun.crossdict][Google
                 Play]] (Java, Android). Developed using Ajoke.el.
*** Input Method
  - [[https://github.com/baohaojun/system-config/tree/master/gcode/scim-cs/ime-py][sdim]] :: An input method for all major Operating Systems: Win32,
            GNU/Linux, Mac OS X and Emacs (Python, C++, ObjC,
            Emacs-lisp).

  - [[https://github.com/scim-im/scim-fcitx][scim-fcitx]] ::  An input method under GNU/Linux, ported from scim
                   and fcitx (C++, GNU/Linux).

*** System Software

  - [[https://github.com/baohaojun/beagrep][beagrep]] :: Combining grep with a search engine for source code
               reading and debugging, can grep 2G source code in 0.23
               second (C#, Perl).

  - [[https://github.com/baohaojun/system-config][system-config]] :: A lot of other system admin scripts/programs, all
                     can be found on [[https://github.com/baohaojun][github]].


* Technical Skills

*** Languages & Libraries
    - Proficient :: Perl, Python, Bash, Emacs Lisp, C, C++, Java, Lua, Qt

    - Used :: ObjC, C#, PHP, Ruby
*** Authoring
    - Text :: Org-mode, Emacs
*** Version Control
    Git, Gerrit
*** System Admin
    System admin for Debian based Gnu/Linux distributions, Bash
    programming

* Education

*** 1997 - 2001
    Bachelor, Control Theory & Engineering, Zhejiang University
*** 2001 - 2004
    Master, Control Theory & Engineering, Institute of Automation,
    Chinese Academy of Science

* Personal Information
*** Date of Birth
    10^{th} March, 1980
*** Mobile Phone
    {{{phone}}}
*** E-mail
    [[mailto:baohaojun@gmail.com][baohaojun@gmail.com]]
*** URLs
- Blog :: [[http://baohaojun.github.io]]
- Code :: [[https://github.com/baohaojun]]
- System-config :: https://github.com/baohaojun/system-config
- System-config Usage Video :: https://www.youtube.com/watch?v=qp2b3-Guej0
- Wrench :: https://github.com/SmartisanTech/Wrench
- Wrench Video :: https://m.youtube.com/watch?v=re_bECYY0rM
- Bbyac :: http://github.com/baohaojun/bbyac
- Org-jira :: https://github.com/baohaojun/org-jira
- Ajoke :: https://github.com/baohaojun/ajoke
- Beagrep :: https://github.com/baohaojun/beagrep



#+BEGIN_EXPORT latex
\end{CJK*}
#+END_EXPORT
