doc/resume/resume-en.tex
% Created 2018-10-30 火 10:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,dvipdfmx,CJKbookmarks]{article}
\usepackage{CJKutf8}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage[export]{adjustbox}
\usepackage{lmodern}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{mycv}
\author{Bao Haojun}
\date{\today}
\title{Haojun Bao's Resume}
\hypersetup{
 pdfauthor={Bao Haojun},
 pdftitle={Haojun Bao's Resume},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)},
 pdflang={English}}
\AtBeginDvi{\special{pdf:tounicode UTF8-UCS2}}
\begin{document}
\begin{CJK*}{UTF8}{simsun}

\maketitle
\AtBeginDvi{\special{pdf:tounicode UTF8-UCS2}}

\section{Work Experience}
\label{sec:orgf041611}
\subsubsection{March 2014 - \emph{present}}
\label{sec:org2f3a074}
\begin{itemize}
\item \textbf{CM Architect}, Smartisan, Beijing
\begin{itemize}
\item Build and improve the CM (Configuration Management) system
\item Build CI (Continuous Integration) system
\item Build SmartBuilder, an online on-demand android build and publish system
\item Build and improve dev process, write dev process documents
\item Deploy my \href{https://github.com/baohaojun/system-config}{system-config} project to each engineer's PC as the dev environment

Simplify the deployment process, improve everyone's efficiency

\item Help colleague engineers solving some difficult problems
\item Provide training on dev tools and programming languages

Record a 2 hours long video on Linux system tools usage tips: \href{https://www.youtube.com/watch?v\%3Dqp2b3-Guej0}{YouTube}

\item Train and support colleagues in CM team
\end{itemize}

\item \textbf{Tools Architect}, Smartisan, Beijing

\begin{itemize}
\item Build some phone manufacturing test tools
\item Build some dev tools
\item Debug phone over heat issue
\item Build \href{https://github.com/SmartisanTech/Wrench}{Wrench}, a PC tool to connect and control Android phones, sync phone screen, record and replay manual operations of the phone in Lua script, and show phone's notifications on the PC
\end{itemize}
\end{itemize}

\subsubsection{September 2013 - March 2014}
\label{sec:orgc1227cc}
\textbf{Technical Expert}, Alibaba, Beijing
\begin{itemize}
\item SMART (software measurement analysis reporting tool) Android
Client App development.
\end{itemize}

\subsubsection{November 2011 - September 2013}
\label{sec:orge48d3ba}
\textbf{Staff Engineer}, \href{http://marvell.com}{Marvell}, Beijing

\begin{itemize}
\item Worked as architect in the Tools team for Marvell's mobile phone
total solution. In charge of designing and implementing mobile
phone factory production tools.

\item Also worked in the BSP team, focusing on tools related
components, such as Uboot, Kernel API, factory partitions.
\end{itemize}


\begin{itemize}
\item Drawing from my experience with open source community, gave
advice for cooperation process with other teams and sites of
Marvell.
\end{itemize}


\subsubsection{March 2010 - October 2011}
\label{sec:orgbea8044}

\textbf{Staff Engineer}, RayzerLink/Letou

\begin{itemize}
\item In charge of system software development for a Tablet product
which uses Nvidia's Tegra2 CPU. Tasks include Linux Kernel
bring-up, device drivers (Touch, LCD, Sensors), HAL.

\item Mentored junior BSP software engineers for system programming.
\end{itemize}

\subsubsection{November 2008 - March 2010}
\label{sec:org46ff093}

\textbf{Senior Engineer}, \href{http://www.borqs.com}{Borqs}

\begin{itemize}
\item Worked in the Tools team at Borqs.

\item Designed and implemented a lot of tools for development,
factory, customer service, test.
\end{itemize}

\subsubsection{September 2005 - September 2008}
\label{sec:org54f306f}

\textbf{Software Engineer}, \href{http://motorola.com}{Motorola},  MD/GSG

\begin{itemize}
\item Developed automated testing tool for Mobile Multimedia Software

\item Developed Mobile Multimedia Software
\end{itemize}

\subsubsection{October 2004 - September 2005}
\label{sec:org5388be5}
\textbf{Software Engineer}, Vitria Software

\begin{itemize}
\item ERP software test
\end{itemize}

\section{Free Software Projects}
\label{sec:org93c1151}

\subsubsection{Emacs}
\label{sec:org005c7a0}
\begin{description}
\item[{\href{http://github.com/baohaojun/bbyac}{bbyac.el}}] A completion command for Emacs (Emacs-lisp).

\item[{\href{https://github.com/baohaojun/org-jira}{org-jira.el}}] An Emacs minor mode for using org-mode to track
Jira issues (Emacs-lisp).

\item[{\href{https://github.com/baohaojun/ajoke}{Ajoke.el}}] A Java/Android IDE/SDK that works with Emacs.
\end{description}

\subsubsection{Android}
\label{sec:org58d72d4}

\begin{description}
\item[{\href{https://github.com/baohaojun/BTAndroidWebViewSelection}{CrossDict}}] An English dictionary Android APK, released on \href{https://play.google.com/store/apps/details?id=com.baohaojun.crossdict}{Google
Play} (Java, Android). Developed using Ajoke.el.
\end{description}
\subsubsection{Input Method}
\label{sec:orgaf5870a}
\begin{description}
\item[{\href{https://github.com/baohaojun/system-config/tree/master/gcode/scim-cs/ime-py}{sdim}}] An input method for all major Operating Systems: Win32,
GNU/Linux, Mac OS X and Emacs (Python, C++, ObjC,
Emacs-lisp).

\item[{\href{https://github.com/scim-im/scim-fcitx}{scim-fcitx}}] An input method under GNU/Linux, ported from scim
and fcitx (C++, GNU/Linux).
\end{description}

\subsubsection{System Software}
\label{sec:org3912aad}

\begin{description}
\item[{\href{https://github.com/baohaojun/beagrep}{beagrep}}] Combining grep with a search engine for source code
reading and debugging, can grep 2G source code in 0.23
second (C\#, Perl).

\item[{\href{https://github.com/baohaojun/system-config}{system-config}}] A lot of other system admin scripts/programs, all
can be found on \href{https://github.com/baohaojun}{github}.
\end{description}


\section{Technical Skills}
\label{sec:org6d76855}

\subsubsection{Languages \& Libraries}
\label{sec:orgc7dec56}
\begin{description}
\item[{Proficient}] Perl, Python, Bash, Emacs Lisp, C, C++, Java, Lua, Qt

\item[{Used}] ObjC, C\#, PHP, Ruby
\end{description}
\subsubsection{Authoring}
\label{sec:orgf877755}
\begin{description}
\item[{Text}] Org-mode, Emacs
\end{description}
\subsubsection{Version Control}
\label{sec:orga5b17b4}
Git, Gerrit
\subsubsection{System Admin}
\label{sec:orgda1bc73}
System admin for Debian based Gnu/Linux distributions, Bash
programming

\section{Education}
\label{sec:orgf048e3b}

\subsubsection{1997 - 2001}
\label{sec:org854216e}
Bachelor, Control Theory \& Engineering, Zhejiang University
\subsubsection{2001 - 2004}
\label{sec:org445a5d4}
Master, Control Theory \& Engineering, Institute of Automation,
Chinese Academy of Science

\section{Personal Information}
\label{sec:org9d6cd15}
\subsubsection{Date of Birth}
\label{sec:org56ba03c}
10\(^{\text{th}}\) March, 1980
\subsubsection{Mobile Phone}
\label{sec:org0c5cffe}
18610314439
\subsubsection{E-mail}
\label{sec:orgbf6115c}
\href{mailto:baohaojun@gmail.com}{baohaojun@gmail.com}
\subsubsection{URLs}
\label{sec:orge96248a}
\begin{description}
\item[{Blog}] \url{http://baohaojun.github.io}
\item[{Code}] \url{https://github.com/baohaojun}
\item[{System-config}] \url{https://github.com/baohaojun/system-config}
\item[{System-config\thinspace Usage Video}] \url{https://www.youtube.com/watch?v=qp2b3-Guej0}
\item[{Wrench}] \url{https://github.com/SmartisanTech/Wrench}
\item[{Wrench\thinspace Video}] \url{https://m.youtube.com/watch?v=re\_bECYY0rM}
\item[{Bbyac}] \url{http://github.com/baohaojun/bbyac}
\item[{Org-jira}] \url{https://github.com/baohaojun/org-jira}
\item[{Ajoke}] \url{https://github.com/baohaojun/ajoke}
\item[{Beagrep}] \url{https://github.com/baohaojun/beagrep}
\end{description}



\end{CJK*}
\end{document}
